Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The directory may contain the item, it may be the same as the item, or it may not have a direct relationship to the item.
ja: ディレクトリはその項目を含むかもしれません、それはその項目と同じかもしれません、またはそれはその項目に対して直接の関係を持たないかもしれません。

source: The directory to be created must not yet exist, but its parent directory must exist.
ja: 作成されるディレクトリはまだ存在してはいけません、しかしそれの親ディレクトリは存在しなければいけません。

source: The display style is platform specific.
ja: 表示形式はプラットホーム特有です。

source: The distance between start and end.
ja: startとendの隔たり。

source: The distance to offset i.
ja: iを補う間隔。

source: The distant future is in terms of centuries.
ja: 遠い未来は、世紀に換算します。

source: The distant past is in terms of centuries.
ja: 遠い過去は、世紀に換算します。

source: The domain of the receiver’s cookie.
ja: レシーバの持つクッキーのドメイン。

source: The drop all zero units behavior.
ja: 全てのゼロ単位を落とす挙動。

source: The drop leading zeroes formatting behavior.
ja: 先頭のゼロを落とす書式設定挙動。

source: The drop middle zero units behavior.
ja: 真ん中のゼロの単位を落とす挙動。

source: The drop trailing zero units behavior.
ja: 後に続くゼロの単位を落とす挙動。

source: The duration.
ja: 期間。

source: The earliest date that can be denoted by a two-digit year specifier.
ja: ２桁の年指定子によって示すことが可能な最も早い日付。

source: The effect is as if suspended with an argument of false were first called if the application is suspended, followed by the notification in question being delivered, followed by a transition back to the previous suspended or unsuspended state.
ja: 効果は、まるでsuspendedが、アプリケーションが待機させられるならば、引数のfalseとともに最初に呼び出された、それに続けて当該の通知が配達されることになり、続けて以前の待機または未待機状態へ推移するかのようです。

source: The effects of NSLogv are not serialized with subsystems other than those discussed above (such as the standard I/O package) and do not produce side effects on those subsystems (such as causing buffered output to be flushed, which may be undesirable).
ja: NSLogvの効果は、上で議論されるそれら以外のサブシステム（例えば標準I/Oパッケージなど）ではシリアライズされません、そして副作用をそれらサブシステム上で生み出しません（例えばバッファされた出力が一気に放出されることを引き起こすなど、それは厄介かもしれません）。

source: The effects of mutating or retaining the returned descriptor are undefined, although it may be copied.
ja: 返される記述子のミューテート（変異）やリテイン（保持）の効果は未定義です、だけれどもそれはおそらくコピーされるでしょう。

source: The effects of retaining the descriptor are undefined; it may be copied, but mutations of the copy are not returned to the sender of the current event.
ja: 記述子のリテイン（保持）の効果は未定義です；それはおそらくコピーされます、しかしコピーの変異体は現在のイベントの送り手に返されません。

source: The effects of retaining the descriptor are undefined; it may be copied, but mutations of the copy are returned to the sender of the suspended event.
ja: 記述子のリテイン（保持）の効果は未定義です；それはおそらくコピーされます、しかしコピーの変異体は休止イベントの送り手に返されます。

source: The element in the array.
ja: 配列の中の要素。

source: The element nodes in an XML tree structure.
ja: XMLツリー構造の中の要素ノード。

source: The element of the set to remove.
ja: 除去されることになる集合の要素。

source: The element that should be split upon.
ja: それで分離されることになる要素。

source: The element to append to the collection.
ja: この要素をコレクションへ追加します。

source: The element to find in the sequence.
ja: このシーケンスにおいて見つける要素。

source: The element to insert.
ja: 挿入される要素。

source: The element to look for in the option set.
ja: オプションセットにおいて捜される要素。

source: The element to repeat.
ja: 繰り返される要素。

source: The elements in the array must have already been sorted using the comparator cmp.
ja: 配列の中の要素は、すでに比較子cmpを使ってソートされ終わっていなければなりません。

source: The elements of the resulting array are ordered according to the given predicate.
ja: 結果の配列の要素は、与えられた述部にしたがって並べられます。

source: The elements to append to the collection.
ja: これらの要素をコレクションへ追加します。

source: The elements to use as members of the new set.
ja: 新しい集合の要素として使うための要素。

source: The encoding to use for the returned bytes.
ja: 返されたバイトに対して使うためのエンコーディング。

source: The end date.
ja: 終了日付。

source: The end index into the data.
ja: データへの末尾インデックス。

source: The end time.
ja: 終了時間。

source: The endian format, either NS_Little Endian or NS_Big Endian.
ja: エンディアン形式、NS_Little EndianまたはNS_Big Endian。

source: The ending date components.
ja: 終了する日付構成要素。

source: The ending date.
ja: 終了日付。

source: The ending index in the range.
ja: 範囲の中の終了インデックス。

source: The ending index in the set.
ja: 集合の中の終了インデックス。

source: The energy value in joules.
ja: ジュールでのエネルギー値。

source: The energy value in the given unit.
ja: 与えられた単位でのエネルギー値。

source: The energy value in the provided unit.
ja: 提供された単位でのエネルギー値。

source: The entitlement consists of an array of group identifier strings that indicate the groups to which the app belongs, as described in Adding an App to an App Group in Entitlement Key Reference.
ja: 資格は、アプリが属しているグループを示すグループ識別子文字列の配列からなります、Adding an App to an App GroupでEntitlement Key Referenceにおいて記述されるように。

source: The enumeration is stopped by setting stop to true in the closure and returning.
ja: 列挙は、stop to trueをクロージャにおいて設定して、返すことによって停止されます。

source: The enumeration produces file reference URLs rather than path-based URLs.
ja: 列挙は、ファイル参照URLを生成します、パスに基づくURLではなく。

source: The enumeration skips hidden volumes.
ja: 列挙は、隠されたボリュームをスキップします。

source: The era symbols for the receiver.
ja: レシーバに対する紀元シンボル。

source: The error code is one of the file-related errors described in NSError Codes.
ja: エラーコードは、NSError Codesにおいて記述されるファイル関連エラーの１つです。

source: The error code itself.
ja: エラーコードそれ自体。

source: The error info dictionary may contain entries that use any combination of the following keys, including no entries at all.
ja: エラー情報辞書は、全く登録項目を含まないことを含めて、以下のキーの任意の組み合わせを使う登録項目を含むことができます。

source: The error object may contain additional debugging information in its description that you can use to identify the cause of the error.
ja: エラーオブジェクトは、補足的なデバッグ情報をそれの説明に含むかもしれません、それはあなたがエラーの原因を突き止めるのに使用できます。

source: The error that occurred during the attempt to copy.
ja: コピーの試みの間に発生したエラー。

source: The error that occurred during the link attempt.
ja: リンクの試みの間に発生したエラー。

source: The error that occurred while attempting to remove the item at URL.
ja: URLでの項目の除去を試みる間に発生したエラー。

source: The error that occurred while trying to move the item in src Path.
ja: src Pathの中の項目を移動しようとする間に発生したエラー。

source: The error that occurred while trying to move the item in src URL.
ja: URLの中の項目を移動しようとする間に発生したエラー。

source: The escaped string.
ja: エスケープされた文字列。

source: The escaped template string.
ja: エスケープされたテンプレート文字列。

source: The event ID (a four-character code) for the receiver, or 0 if an error occurs.
ja: レシーバに対するイベントID（４文字コード）、またはエラーが起こるならば０。

source: The event ID for the receiver.
ja: レシーバに対するイベントID。

source: The event ID to be set in the returned descriptor.
ja: 返される記述子の中に設定されるイベントID。

source: The event class (a four-character code) for the receiver, or 0 if an error occurs.
ja: レシーバに対するイベントクラス（４文字コード）、またはエラーが起こるならば０。

source: The event class for the receiver.
ja: レシーバに対するイベントクラス。

source: The event class to be set in the returned descriptor.
ja: 返される記述子の中に設定されるイベントクラス。

source: The exact behavior of this method is implementation-defined.
ja: このメソッドの正確な挙動は、実装定義です。

source: The exact location of the directory in the file system might change in future releases of macOS, but this method will always return the correct URL.
ja: ファイルシステム中のディレクトリの正確な位置は、将来のmacOSのリリースで変わるかもしれません、しかしこのメソッドは常に正確なURLを返します。

source: The example above shows how the automatic conversion differs from the conversion you might expect: base URI.
ja: 上の例は、どのように自動的な変換があなたが期待するであろう変換：base URIと異なるかを示します。

source: The example below shows how automatic Codable conformance applies when a location property is added to the Landmark structure:
ja: 下の例は、自動的にCodable準拠を、locationプロパティがLandmark構造体に加えられる時に適用する方法を示します：

source: The example below shows how automatic conformance still applies when adding multiple properties using built-in codable types within Landmark:
ja: 下の例は、どのように自動的な準拠が依然として適用されるか、複数のプロパティを組込みのコード化可能型を使ってLandmark構造体内部に加える場合に示します：

source: The example below shows how properties on the Olympic Event Result structure are converted from snake-case when decoded as keys in a JSON object.
ja: 下の例は、Olympic Event Result構造体上のプロパティが、JSONオブジェクトの中のキーとしてデコードされる場合に、スネークケースから変換される方法を示します。

source: The example below shows how the Coordinate structure can be extended to conform to the Encodable protocol by implementing its required method, encode(to:):
ja: 下の例は、どのようにCoordinate構造体が拡張されて、Encodableプロトコルにそれの必須メソッドencode(to:)を実装することで準拠するかを示します：

source: The example below shows how to decode an instance of a simple Grocery Product type from a JSON object.
ja: 下の例は、単純なGrocery Product型のインスタンスを JSONオブジェクトからデコードする方法を示します。

source: The example below shows how to decode the properties of the nested A, B, and C structures with custom logic that you specify in the closure value associated with the custom case.
ja: 下の例は、入れ子にされたA、B、そしてC構造体のプロパティを、あなたがあつらえのケース節と結び付けられたクロージャ値において指定するあつらえの論理で、デコードする方法を示します。

source: The example below shows how to encode an instance of a simple Grocery Product type from a JSON object.
ja: 下の例は、単純なGrocery Product型のインスタンスを JSONオブジェクトからエンコードする方法を示します。

source: The example below shows how to encode the properties of the nested A, B, and C structures with custom logic that you specify in the closure value associated with the custom case.
ja: 下の例は、入れ子にされたA、B、そしてC構造体のプロパティを、あなたがあつらえのケース節と結び付けられたクロージャ値において指定するあつらえの論理で、エンコードする方法を示します。

source: The example below uses alternative keys for the name and founding Year properties of the Landmark structure when encoding and decoding:
ja: 下の例は、代替キーの使用を、Landmark構造体のnameとfounding Yearプロパティに対して、エンコードおよびデコードする時に行います。

source: The example regular expression contains two capture groups, corresponding to the two sets of parentheses, one for the first letter, and one for the second.
ja: この例の正規表現は、最初の文字のためのものと２番目のためのもの、２つの括弧対に対応している、２つの捕獲グループを含みます。

source: The examples below show alternative declarations of the Landmark structure that only encode or decode data:
ja: 下の例は、Landmark構造体でデータのエンコードまたはデコードのみを行う選択的な宣言を示します：

source: The execution time of this method can be highly variable, depending on the local network configuration, and may block for several seconds if the network is unreachable.
ja: このメソッドの実行時間は、ローカルネットワーク構成設定に依存して非常に変動します、そしてネットワークが読み込みできないならば数秒間遮断されるかもしれません。

source: The expiration date is the date when the cookie should be deleted.
ja: 有効期限は、クッキーが削除されるべき時の日付です。

source: The exponent of the decimal.
ja: 10進数の指数。

source: The extended attribute key that identifies the protection level for this file.
ja: このファイルの保護水準を識別する拡張属性キー。

source: The extension of the resource file.
ja: リソースファイルの拡張子。

source: The file URL at which to create the new symbolic link.
ja: このファイルURLで新しいシンボリックリンクを作成することになります。

source: The file URL for the bundle’s App Store receipt.
ja: バンドルの持つApp Storeレシートに対するファイルURL。

source: The file URL for the resource file or nil if the file could not be located.
ja: リソースファイルに対するファイルURL、またはファイルが捜し出されることができなかったならばnil。

source: The file URL of a document or directory.
ja: ある書類またはディレクトリのファイルURL。

source: The file URL of the bundle to search.
ja: 調査することになるバンドルのファイルURL。

source: The file URL of the bundle’s subdirectory containing private frameworks.
ja: プライベートフレームワークを含んでいる、バンドルの持つ下位ディレクトリのファイルURL。

source: The file URL of the bundle’s subdirectory containing resource files.
ja: リソースファイルを含んでいる、バンドルの持つ下位ディレクトリのファイルURL。

source: The file URL of the bundle’s subdirectory containing shared support files.
ja: 共有サポートファイルを含んでいる、バンドルの持つ下位ディレクトリのファイルURL。

source: The file URL of the executable executable Name in the receiver’s bundle.
ja: レシーバの持つバンドルの中の実行可能ファイルexecutable NameのファイルURL。

source: The file URL of the receiver's executable file.
ja: レシーバの持つ実行ファイルのファイルURL。

source: The file URL of the receiver's subdirectory containing plug-ins.
ja: プラグインを含んでいる、レシーバの持つ下位ディレクトリのファイルURL。

source: The file URL of the receiver's subdirectory containing shared frameworks.
ja: 共有フレームワークを含んでいる、レシーバの持つ下位ディレクトリのファイルURL。

source: The file URL that contains the item to be pointed to by the link.
ja: リンクによって指し示される項目を含んでいるファイルURL。

source: The file URL that identifies the file or directory you want to move.
ja: あなたが移動することを望むファイルを識別するファイルURL。

source: The file URL that identifies the file you want to copy.
ja: あなたがコピーすることを望むファイルを識別するファイルURL。

source: The file URL that identifies the source of the link.
ja: リンクの出所を識別するファイルURL。

source: The file URL that specifies where you want to create the hard link.
ja: ファイルURL、それはあなたがハードリンクを作成することを望むのはどこかを指定します。

source: The file URL to a directory.
ja: あるディレクトリへのファイルURL。

source: The file URL used to determine the location of the returned URL.
ja: 返されるURLの位置を決定するために使われるファイルURL。

source: The file at the specified URL must already be uploaded to iCloud when you call this method.
ja: 指定されたURLでのファイルは、あなたがこのメソッドを呼び出すとき既にiCloudにアップロードされていなければなりません。

source: The file attributes for the new directory and any newly created intermediate directories.
ja: 新しいディレクトリおよび新しく作成された中間ディレクトリに対するファイル属性。

source: The file attributes for the new directory.
ja: 新しいディレクトリに対するファイル属性。

source: The file attributes’ dictionary is the same format as that returned by attributes Of Item(at Path:) (NSFile Manager).
ja: ファイル属性の持つ辞書は、attributes Of Item(at Path:) (NSFile Manager)によって返されるものと同じ形式です。

source: The file descriptor you pass in to this method is not owned by the file handle object.
ja: あなたがこのメソッドに渡すファイル記述子は、ファイルハンドルオブジェクトによって所有されません。

source: The file has no special protections associated with it.
ja: ファイルは、それと結び付けられる特別な保護を持ちません。

source: The file is stored in an encrypted format on disk and cannot be accessed until after the device has booted.
ja: ファイルは、暗号化された形式でディスク上に格納されます、そしてデバイスが立ち上がってしまった後までアクセスされることができません。

source: The file is stored in an encrypted format on disk and cannot be read from or written to while the device is locked or booting.
ja: ファイルは、暗号化された形式でディスク上に格納されます、そしてデバイスがロックされるまたは立ち上がっている間に読み出されたり書き込まれたりできません。

source: The file is stored in an encrypted format on disk.
ja: ファイルは、暗号化された形式でディスク上に格納されます。

source: The file manager always prefers methods that take an NSURL object over those that take an NSString object.
ja: ファイルマネージャは常にNSURLオブジェクトを取るメソッドを好みます、NSStringオブジェクトを取るものよりも。

source: The file manager calls this method when there is a problem copying the item to the specified location.
ja: ファイルマネージャは、項目を指定された場所へコピーすることに問題がある場合に、このメソッドを呼び出します。

source: The file manager calls this method when there is a problem creating a hard link to the item at the specified location.
ja: ファイルマネージャは、指定された場所での項目へのハードリンクを作成することに問題がある場合に、このメソッドを呼び出します。

source: The file manager calls this method when there is a problem deleting the item to the specified location.
ja: ファイルマネージャは、指定された場所に対して項目を削除することに問題がある場合に、このメソッドを呼び出します。

source: The file manager calls this method when there is a problem moving the item to the specified location.
ja: ファイルマネージャは、指定された場所に対して項目を移動することに問題がある場合に、このメソッドを呼び出します。

source: The file manager object that attempted to copy the item.
ja: 項目のコピーを試みたファイルマネージャオブジェクト。

source: The file manager object that attempted to create the link.
ja: リンクの作成を試みたファイルマネージャオブジェクト。

source: The file manager object that attempted to move the item.
ja: 項目の移動を試みたファイルマネージャオブジェクト。

source: The file manager object that attempted to remove the item.
ja: 項目の除去を試みたファイルマネージャオブジェクト。

source: The file manager object that is attempting to copy the file or directory.
ja: ファイルまたはディレクトリのコピーを試みているファイルマネージャオブジェクト。

source: The file manager object that is attempting to create the link.
ja: リンクの作成を試みているファイルマネージャオブジェクト。

source: The file manager object that is attempting to move the file or directory.
ja: ファイルまたはディレクトリの移動を試みるファイルマネージャオブジェクト。

source: The file manager object that is attempting to remove the file or directory.
ja: ファイルまたはディレクトリの除去を試みるファイルマネージャオブジェクト。

source: The file must be a flat file, not a bundle.
ja: ファイルは、フラットファイルでなければなりません、バンドルでなく。

source: The file offset with the file pointer at the end of the file.
ja: ファイル終端でのファイルポインタに関するファイルオフセット。

source: The file path associated with the error, if any.
ja: エラーと関連するファイルパス、もしあれば。

source: The file pointer is set to the beginning of the file.
ja: ファイルポインタは、ファイルの始まりに設定されます。

source: The file system domain to search.
ja: 検索するファイルシステム領域。

source: The file to read.
ja: 読み込むファイル。

source: The file wrapper is initialized with open permissions: anyone can modify or read the file reference.
ja: ファイルラッパーは、開放権限で初期化されます：誰もがそのファイル参照を変更または読み出しできます。

source: The file wrapper is initialized with open permissions: anyone can write to or read the file wrapper.
ja: ファイルラッパーは、開放権限で初期化されます：誰もがそのファイルラッパーを読み書きできます。

source: The file wrapper is not associated with a file-system node until you save it using write(to: options: original Contents URL:).
ja: ファイルラッパーは、あなたがそれをwrite(to: options: original Contents URL:)を使って保存するまでは、ファイルシステムノードと結び付けられません。

source: The file wrappers contained by a directory file wrapper.
ja: ファイルラッパーは、ディレクトリファイルラッパーによって含まれます。

source: The filename extension of the file to locate.
ja: 捜し出すファイルのファイル名拡張子。

source: The filename extension of the files to locate.
ja: 捜し出すファイルのファイル名拡張子。

source: The filename is used for record-keeping purposes only and is set automatically when the file wrapper is created from the file system using init(url: options:) and when it’s saved to the file system using write(to: options: original Contents URL:) (although this method allows you to request that the filename not be updated).
ja: ファイル名は、レコード保存の目的のみに使われます、そしてファイルラッパーがファイルシステムからinit(url: options:)を使って作成される場合そしてそれがファイルシステムにwrite(to: options: original Contents URL:)を使って保存される場合、自動的に設定されます（とは言えこのメソッドはファイル名が更新されないようあなたに要請させます）。

source: The filename is usually the same as the preferred filename, but might instead be a name derived from the preferred filename.
ja: ファイル名は、ふつうは優先ファイル名と同じです、しかしその代わりに優先名から引き出された名前であるかもしれません。

source: The filename of the file wrapper object
ja: ファイルラッパーオブジェクトのファイル名。

source: The filename of the image resource file.
ja: 画像リソースファイルのファイル名。

source: The final accumulated value.
ja: 最終的に蓄積された値。

source: The final example passes false for the omitting Empty Subsequences parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はfalseをomitting Empty Subsequencesパラメータに対して渡します、それで返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The first capture group range is given by [result range At Index: 1], the second by [result range At Index: 2].
ja: 最初の捕獲グループ範囲は[result range At Index: 1]で、２番目は[result range At Index: 2]で与えられます。

source: The first descriptor specifies the primary key path to be used in sorting the receiving array’s contents.
ja: 最初の記述子は、プライマリキー（主キー）のパスを指定して、受け手側の配列の持つ内容をソートするのに使われます。

source: The first element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最初の要素；そうでなければnil。

source: The first element of the collection.
ja: コレクションの最初の要素。

source: The first element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最初の要素、またはpredicateを満たす要素が無いならばnil。

source: The first index where element is found.
ja: elementが見つけられたところの最初のインデックス。

source: The first integer in self, or nil if self is empty.
ja: selfの中の最初の整数、またはselfが空ならばnil。

source: The first is the value to be converted.
ja: 最初のものは、変換されることになる値です。

source: The first moment of the given date.
ja: 与えられた日付の最初の瞬間。

source: The first object for the array.
ja: この配列に対する最初のオブジェクト。

source: The first object in the array.
ja: この配列の最初のオブジェクト。

source: The first partition, numbers[..<p], is made up of the elements that are not greater than 30.
ja: 最初の区画、numbers[..<p]は、30より大きくない要素から構成されます。

source: The first time you call this method for a given ubiquity container, the system extends your app’s sandbox to include that container.
ja: このメソッドを与えられた偏在コンテナに対して呼び出す最初の時、システムは、あなたのアプリのサンドボックスをそのコンテナを含むように拡張します。

source: The first use of split returns each word that was originally separated by one or more spaces.
ja: splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The first weekday of the calendar.
ja: カレンダーの最初の曜日。

source: The flags are defined in Flag Options.
ja: フラグは、「フラグ・オプション」で定義されます

source: The following code fragment gets the path to a plist within the bundle, and loads it into an NSDictionary:
ja: 以下のコード断片は、バンドル内のあるplistへのパスを取得します、そしてそれをNSDictionaryへとロードします：

source: The following constants should not be used and may eventually be removed.
ja: 以下の定数は使われるべきではありません、そしていつかは取り除かれるでしょう。

source: The following constants specify predefined format styles for dates and times.
ja: 以下の定数は、日付と時刻に対するあらかじめ定義された書式設定スタイルを指定します。

source: The following example (which is paired with the example given in string(for:)) converts a string representation of a dollar amount that includes the dollar sign; it uses an NSScanner instance to convert this amount to a float after stripping out the initial dollar sign.
ja: 以下の例（それはstring(for:)で与えられる例と１組になるものです）は、ドル符号を含むドル額の文字列表現を変換します；それはNSScannerインスタンスを使ってこの量を、冒頭のドル符号を剥ぎ取った後に、浮動小数点数に変換します。

source: The following example adds a new number to an array of integers:
ja: 次の例は、ある新しい要素を整数からなる配列へ加えます：

source: The following example appends the elements of a Range<Int> instance to an array of integers:
ja: 次の例は、Range<Int>インスタンスからなるいくらかの要素を整数からなる配列に追加します：

source: The following example drops the first element from an array of integers.
ja: 以下の例は、整数からなる配列から最初の要素を落とします。

source: The following example obtains an index advanced four positions from a string’s starting index and then prints the character at that position.
ja: 以下の例は、文字列の開始インデックスから４位置進んだインデックスを取得して、それからその位置の文字を出力します。

source: The following example obtains an index advanced four positions from an array’s starting index and then prints the element at that position.
ja: 以下の例は、配列の始まりから４位置進んだインデックスを入手して、それからその位置での要素を出力します。

source: The following example returns a modified copy, but there is a corresponding method for modifying a mutable string in place.
ja: 以下の例は修正されたコピーを返します、しかし可変文字列をその場で修正する対応するメソッドがあります。

source: The following example reverses the elements of an array of characters:
ja: 以下の例は、文字列からなる配列の要素を逆順にします：

source: The following example searches for the index of the number 40 in an array of integers, and then prints the suffix of the array starting at that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスで始まる配列の末尾を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, and including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、そしてそれを含めて、配列の冒頭を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, but not including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、しかしそれを含めずに、配列の冒頭を出力します。

source: The following example shows the difference between the date formats for British and American English:
ja: 以下の例は、British と American English に対する日付書式設定の間の差を示します：

source: The following example uses the first(where:) method to find the first negative number in an array of integers:
ja: 以下の例は、first(where:)メソッドを使って、整数の配列において最初の負数を見つけます：

source: The following examples show the effects of the max Splits and omitting Empty Subsequences parameters when splitting a string at each space character (” “). The first use of split returns each word that was originally separated by one or more spaces.
ja: 以下の例は、ある文字列を各空白文字（” “）で分割する場合のmax Splitsとomitting Empty Subsequencesパラメータの効果を示します。splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The following examples show the effects of the max Splits and omitting Empty Subsequences parameters when splitting a string using a closure that matches spaces.
ja: 以下の例は、max Splitsとomitting Empty Subsequencesパラメータの効果を、空白にマッチするクロージャを使って文字列を分割する場合で示します。

source: The following examples show the result of applying this strategy:
ja: 以下の例は、この戦略を適用する結果を示します：

source: The following flags control various aspects of regular expression matching.
ja: 以下のフラグは、正規表現マッチングのさまざまな面を制御します。
